In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv("E://Excelr Assignment//titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# check how many rows and columns are there.
df.shape

(891, 12)

In [5]:
# print all the columns
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
# information about data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
# check data types of every columns
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
# statistical information about data
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
# check how many columns have missing values.
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
# rename the column name 
df_train=df.rename({'Ticket':'Ticket_Number'},axis=1,inplace=True)

In [15]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket_Number,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [19]:
# find the average age of students
mean_value=round(df['Age'].mean())
mean_value

30

In [20]:
# fill null value with average
df['Age'].fillna(df['Age'].mean(),inplace=True)

In [21]:
# check for null value
df.isna().sum()

PassengerId        0
Survived           0
Pclass             0
Name               0
Sex                0
Age                0
SibSp              0
Parch              0
Ticket_Number      0
Fare               0
Cabin            687
Embarked           2
dtype: int64

In [22]:
df['Cabin'].value_counts()

B96 B98        4
G6             4
C23 C25 C27    4
C22 C26        3
F33            3
              ..
E34            1
C7             1
C54            1
E36            1
C148           1
Name: Cabin, Length: 147, dtype: int64

In [23]:
df['Cabin'].head(5)

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [24]:
# fill null value in column Cabin using bfill and ffill
# backword filling
df['Cabin'].bfill(inplace=True)

In [25]:
df['Cabin'].head(5)

0     C85
1     C85
2    C123
3    C123
4     E46
Name: Cabin, dtype: object

In [26]:
# forward filling
df['Cabin'].ffill(inplace=True)

In [27]:
df['Cabin'].tail(5)

886     B42
887     B42
888    C148
889    C148
890    C148
Name: Cabin, dtype: object

In [28]:
df['Cabin'].sample(5)

188     F2
834    E49
493    D20
479    B49
93      A5
Name: Cabin, dtype: object

In [29]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket_Number    0
Fare             0
Cabin            0
Embarked         2
dtype: int64

In [30]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [33]:
df[df['Embarked'].isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket_Number,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [37]:
df['Embarked'].mode()[0]

'S'

In [38]:
df['Embarked'].fillna(df['Embarked'].mode()[0],inplace=True)

In [39]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket_Number    0
Fare             0
Cabin            0
Embarked         0
dtype: int64

# How many male passengers are  in titanic ship? 
male passanger = 577

# which passenger class has highest customers?
class3 == 491

# which Passenger class has highest fare price? 
class1 == 84.154

# calculate the average fare price for male and female passenger?
avg_fare_price_male = 25.52
avg_fare_price_female == 44.4798

# what is survival ratio?
surival_ratio = 0.387

# which age group is max survived?
age_groups  survival_ratio
[0-20]         
[21-40]        
[41-60]          
[60-90]        


# survived ratio for passenger class by gender.

### Q1. How many male passengers are  in titanic ship?

In [50]:
# How many male passengers are  in titanic ship? 
df.groupby(by=['Sex'])['PassengerId'].count().sort_values(ascending=False)

Sex
male      577
female    314
Name: PassengerId, dtype: int64

In [46]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [51]:
pd.pivot_table(df,values=['PassengerId'],columns=['Sex'],aggfunc='count')

Sex          female  male
PassengerId     314   577

In [54]:
df['Sex'][df['Sex']=='male'].count()

577

### Q2. which passenger class has highest customers?

In [55]:
# which passenger class has highest customers?

df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [67]:
df.groupby(['Pclass']).count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket_Number,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,216,216,216,216,216,216,216
2,184,184,184,184,184,184,184,184,184,184,184
3,491,491,491,491,491,491,491,491,491,491,491

In [69]:
df.pivot_table(values='PassengerId',columns=['Pclass'],aggfunc='count')

Pclass         1    2    3
PassengerId  216  184  491

### Q3. which Passenger class has highest fare price?

In [73]:
# which Passenger class has highest fare price? 
df.groupby(['Pclass'])['Fare'].mean().head(1)

Pclass
1    84.154687
Name: Fare, dtype: float64

In [77]:
pd.pivot_table(df,values='Fare',columns='Pclass')

Pclass          1          2         3
Fare    84.154687  20.662183  13.67555

### Q4. calculate the average fare price for male and female passenger?

In [78]:
# calculate the average fare price for male and female passenger?
df.groupby(['Sex'])['Fare'].mean()

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [81]:
pd.pivot_table(df,values='Fare',columns='Sex',aggfunc='mean')

Sex      female       male
Fare  44.479818  25.523893

### Q5. what is survival ratio?

In [82]:
#what is survival ratio?
df['Survived'].value_counts()/len(df)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [86]:
survived_count=(df['Survived']==1).sum()
survived_ratio=survived_count/len(df)
survived_ratio

0.3838383838383838

In [87]:
(df['Survived']==1).sum()/len(df)

0.3838383838383838

### Q6. which age group is max survived?

# which age group is max survived?
age_groups  survival_ratio
[0-20]         
[21-40]        
[41-60]          
[60-90]

In [89]:
#[0-20]
df1 = df[(df['Age'] > 0) & (df['Age']<=20)]
df_1 = len(df1[df1['Survived'] == 1])/len(df)
df2 = df[(df['Age'] > 20) & (df['Age']<=40)]
df_2 = len(df2[df2['Survived'] == 1])/len(df)
df3 = df[(df['Age'] > 40) & (df['Age']<=60)]
df_3 = len(df3[df3['Survived'] == 1])/len(df)
df4 = df[(df['Age'] > 60) & (df['Age']<=80)]
df_4 = len(df4[df4['Survived'] == 1])/len(df)

In [90]:
df_1+df_2+df_3+df_4

0.3838383838383838

### Q7. survived ratio for passenger class by gender.

In [94]:
# survived ratio for passenger class by gender.
df.groupby(['Pclass','Sex'])['Survived'].sum()/len(df)

Pclass  Sex
1       female    0.102132
        male      0.050505
2       female    0.078563
        male      0.019080
3       female    0.080808
        male      0.052750
Name: Survived, dtype: float64

In [96]:
pd.pivot_table(df,values=['Survived'],columns=['Pclass','Sex'],aggfunc='sum')/len(df)

Pclass           1                   2                  3
Sex         female      male    female     male    female     male
Survived  0.102132  0.050505  0.078563  0.01908  0.080808  0.05275